# Определите является ли данный символ цифрой или нет.

c = input()

if c.isdigit():
    print('YES')
else:
    print('NO')
