# Выведите с помощью вложенных циклов
# 6x7

for i in range(7):
    for i in range(6):
        print('2', end = ' ')
    print()
