# Задание 1
# Напишите программу, которая выводит "Hello, GloAcademy!" (без кавычек) 25 раз.

for i in range(24):
    print('Hello, GloAcademy!')
