# Задание 1 из урока 3
# Выведите на экран
#
# Glo Academy
#
# Glo Academy
#
# Сделайте это разными способами:
# 1. с помощью трех команд print
# 2. с помощью одной команды print

# Вариант 1
print ('Glo Academy')
print ('')
print ('Glo Academy')

# Вариант 2
print ('Glo Academy', 'Glo Academy', sep='\n\n')
