# Вводится одно вещественное число.
# Определите является ли оно положительным, отрицательным или нулем.

a = float(input())

if a > 0:
    print('Положительное')
elif a < 0:
    print('Отрицательное')
else:
    print('0')
